
## Plan Result (dev)

[CI link](https://github.com/fumi-mura/infra_portfolio/actions/runs/14572372084)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * module.test_1_cwlogs.aws_cloudwatch_log_group.this
* Delete
  * module.test_1_s3.aws_s3_bucket.this
  * module.test_1_s3.aws_s3_bucket_public_access_block.this
  * module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this
  * module.test_1_s3.aws_s3_bucket_versioning.this
  * module.test_2_s3.aws_s3_bucket.this
  * module.test_2_s3.aws_s3_bucket_public_access_block.this
  * module.test_2_s3.aws_s3_bucket_server_side_encryption_configuration.this
  * module.test_2_s3.aws_s3_bucket_versioning.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.test_1_cwlogs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-1"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "test-1"
        }
      + tags_all          = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "test-1"
        }
    }

  # module.test_1_s3.aws_s3_bucket.this will be destroyed
  # (because aws_s3_bucket.this is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::dev-fumis-pf-test-1-s3-bucket" -> null
      - bucket                      = "dev-fumis-pf-test-1-s3-bucket" -> null
      - bucket_domain_name          = "dev-fumis-pf-test-1-s3-bucket.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "dev-fumis-pf-test-1-s3-bucket.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "dev-fumis-pf-test-1-s3-bucket" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "dev-fumis-pf-test-1-s3-bucket"
        } -> null
      - tags_all                    = {
          - "Environment"        = "dev"
          - "ManagedByTerraform" = "true"
          - "Name"               = "dev-fumis-pf-test-1-s3-bucket"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "42fcced65391ac0bb4329ab830771c90d186802007abc036498942ecc41aacf6" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.test_1_s3.aws_s3_bucket_public_access_block.this will be destroyed
  # (because aws_s3_bucket_public_access_block.this is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "dev-fumis-pf-test-1-s3-bucket" -> null
      - id                      = "dev-fumis-pf-test-1-s3-bucket" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.this is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      - bucket                = "dev-fumis-pf-test-1-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-1-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_1_s3.aws_s3_bucket_versioning.this will be destroyed
  # (because aws_s3_bucket_versioning.this is not in configuration)
  - resource "aws_s3_bucket_versioning" "this" {
      - bucket                = "dev-fumis-pf-test-1-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-1-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Enabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.test_2_s3.aws_s3_bucket.this will be destroyed
  # (because aws_s3_bucket.this is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::dev-fumis-pf-test-2-s3-bucket" -> null
      - bucket                      = "dev-fumis-pf-test-2-s3-bucket" -> null
      - bucket_domain_name          = "dev-fumis-pf-test-2-s3-bucket.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "dev-fumis-pf-test-2-s3-bucket.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "dev-fumis-pf-test-2-s3-bucket" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "dev-fumis-pf-test-2-s3-bucket"
        } -> null
      - tags_all                    = {
          - "Environment"        = "dev"
          - "ManagedByTerraform" = "true"
          - "Name"               = "dev-fumis-pf-test-2-s3-bucket"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "42fcced65391ac0bb4329ab830771c90d186802007abc036498942ecc41aacf6" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.test_2_s3.aws_s3_bucket_public_access_block.this will be destroyed
  # (because aws_s3_bucket_public_access_block.this is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "dev-fumis-pf-test-2-s3-bucket" -> null
      - id                      = "dev-fumis-pf-test-2-s3-bucket" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.test_2_s3.aws_s3_bucket_server_side_encryption_configuration.this will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.this is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      - bucket                = "dev-fumis-pf-test-2-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-2-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_2_s3.aws_s3_bucket_versioning.this will be destroyed
  # (because aws_s3_bucket_versioning.this is not in configuration)
  - resource "aws_s3_bucket_versioning" "this" {
      - bucket                = "dev-fumis-pf-test-2-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-2-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Enabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":34,"Program":"tfcmt","SHA1":"81d8e8f36ba10d0fcdaf42fbaf522e8b1e35f21e","Target":"dev","Vars":{},"WorkflowName":"Plan"} -->